const Map<String, dynamic> citiesData = {
  "110000": {
    "110100": {
      "name": "阿拉巴马州",
      "alpha": "a",
      "latitude": "32.806671",
      "longitude": "-86.791130"
    }
  },
  "120000": {
    "120100": {
      "name": "阿拉斯加州",
      "alpha": "a",
      "latitude": "61.370716",
      "longitude": "-152.404419"
    }
  },
  "130000": {
    "130100": {
      "name": "亚利桑那州",
      "alpha": "y",
      "latitude": "33.729759",
      "longitude": "-111.431221"
    }
  },
  "140000": {
    "140100": {
      "name": "阿肯色州",
      "alpha": "a",
      "latitude": "34.969704",
      "longitude": "-92.373123"
    }
  },
  "150000": {
    "150100": {
      "name": "加利福尼亚州",
      "alpha": "j",
      "latitude": "36.116203",
      "longitude": "-119.681564"
    }
  },
  "160000": {
    "160100": {
      "name": "科罗拉多州",
      "alpha": "k",
      "latitude": "39.059811",
      "longitude": "-105.311104"
    }
  },
  "170000": {
    "170100": {
      "name": "康涅狄格州",
      "alpha": "k",
      "latitude": "39.059811",
      "longitude": "-105.311104"
    }
  },
  "180000": {
    "180100": {
      "name": "特拉华州",
      "alpha": "t",
      "latitude": "39.318523",
      "longitude": "-75.507141"
    }
  },
  "190000": {
    "190100": {
      "name": "佛罗里达州",
      "alpha": "f",
      "latitude": "27.766279",
      "longitude": "-81.686783"
    }
  },
  "210000": {
    "210100": {
      "name": "乔治亚州",
      "alpha": "q",
      "latitude": "33.040619",
      "longitude": "-83.643074"
    }
  },
  "220000": {
    "220100": {
      "name": "夏威夷州",
      "alpha": "x",
      "latitude": "21.094318",
      "longitude": "-157.498337"
    }
  },
  "230000": {
    "230100": {
      "name": "爱达荷州",
      "alpha": "a",
      "latitude": "44.240459",
      "longitude": "-114.478828"
    }
  },
  "240000": {
    "240100": {
      "name": "伊利诺伊州",
      "alpha": "y",
      "latitude": "40.349457",
      "longitude": "-88.986137"
    }
  },
  "250000": {
    "250100": {
      "name": "印地安那州",
      "alpha": "y",
      "latitude": "39.849426",
      "longitude": "-86.258278"
    }
  },
  "260000": {
    "260100": {
      "name": "爱荷华州",
      "alpha": "a",
      "latitude": "42.011539",
      "longitude": "-93.210526"
    }
  },
  "270000": {
    "270100": {
      "name": "堪萨斯州",
      "alpha": "k",
      "latitude": "38.526600",
      "longitude": "-96.726486"
    }
  },
  "280000": {
    "280100": {
      "name": "肯塔基州",
      "alpha": "k",
      "latitude": "37.668140",
      "longitude": "-84.670067"
    }
  },
  "290000": {
    "290100": {
      "name": "路易斯安那州",
      "alpha": "l",
      "latitude": "31.169546",
      "longitude": "-91.867805"
    }
  },
  "310000": {
    "310100": {
      "name": "缅因州",
      "alpha": "m",
      "latitude": "44.693947",
      "longitude": "-69.381927"
    }
  },
  "320000": {
    "320100": {
      "name": "马里兰州",
      "alpha": "m",
      "latitude": "39.063946",
      "longitude": "-76.802101"
    }
  },
  "340000": {
    "340100": {
      "name": "马萨诸塞州",
      "alpha": "m",
      "latitude": "42.230171",
      "longitude": "-71.530106"
    }
  },
  "350000": {
    "350100": {
      "name": "密歇根州",
      "alpha": "m",
      "latitude": "43.326618",
      "longitude": "-84.536095"
    }
  },
  "360000": {
    "360100": {
      "name": "明尼苏达州",
      "alpha": "m",
      "latitude": "45.694454",
      "longitude": "-93.900192"
    }
  },
  "370000": {
    "370100": {
      "name": "密西西比州",
      "alpha": "m",
      "latitude": "32.741646",
      "longitude": "-89.678696"
    }
  },
  "380000": {
    "380100": {
      "name": "密苏里州",
      "alpha": "m",
      "latitude": "38.456085",
      "longitude": "-92.288368"
    }
  },
  "390000": {
    "390100": {
      "name": "蒙大拿州",
      "alpha": "m",
      "latitude": "38.456085",
      "longitude": "-92.288368"
    }
  },
  "410000": {
    "410100": {
      "name": "内布拉斯加州",
      "alpha": "n",
      "latitude": "41.125370",
      "longitude": "-98.268082"
    }
  },
  "420000": {
    "420100": {
      "name": "内华达州",
      "alpha": "n",
      "latitude": "38.313515",
      "longitude": "-117.055374"
    }
  },
  "430000": {
    "430100": {
      "name": "新罕布什尔州",
      "alpha": "x",
      "latitude": "43.452492",
      "longitude": "-71.563896"
    }
  },
  "440000": {
    "440100": {
      "name": "新泽西州",
      "alpha": "x",
      "latitude": "40.298904",
      "longitude": "-74.521011"
    }
  },
  "450000": {
    "450100": {
      "name": "新墨西哥州",
      "alpha": "x",
      "latitude": "34.840515",
      "longitude": "-106.248482"
    }
  },
  "460000": {
    "460100": {
      "name": "纽约州",
      "alpha": "n",
      "latitude": "42.165726",
      "longitude": "-74.948051"
    }
  },
  "470000": {
    "470100": {
      "name": "北卡罗来纳州",
      "alpha": "b",
      "latitude": "35.630066",
      "longitude": "-79.806419"
    }
  },
  "480000": {
    "480100": {
      "name": "北达科他州",
      "alpha": "b",
      "latitude": "47.528912",
      "longitude": "-99.784012"
    }
  },
  "490000": {
    "490100": {
      "name": "俄亥俄州",
      "alpha": "e",
      "latitude": "40.388783",
      "longitude": "-82.764915"
    }
  },
  "510000": {
    "510100": {
      "name": "俄克拉荷马州",
      "alpha": "e",
      "latitude": "35.565342",
      "longitude": "-96.928917"
    }
  },
  "520000": {
    "520100": {
      "name": "俄勒冈州",
      "alpha": "e",
      "latitude": "44.572021",
      "longitude": "-122.070938"
    }
  },
  "530000": {
    "530100": {
      "name": "宾夕法尼亚州",
      "alpha": "b",
      "latitude": "40.590752",
      "longitude": "-77.209755"
    }
  },
  "540000": {
    "540100": {
      "name": "罗得岛州",
      "alpha": "l",
      "latitude": "41.680893",
      "longitude": "-71.511780"
    }
  },
  "550000": {
    "550100": {
      "name": "南卡罗来纳州",
      "alpha": "n",
      "latitude": "33.856892",
      "longitude": "-80.945007"
    }
  },
  "560000": {
    "560100": {
      "name": "南达科他州",
      "alpha": "n",
      "latitude": "44.299782",
      "longitude": "-99.438828"
    }
  },
  "570000": {
    "570100": {
      "name": "田纳西州",
      "alpha": "t",
      "latitude": "35.747845",
      "longitude": "-86.692345"
    }
  },
  "580000": {
    "580100": {
      "name": "德克萨斯州",
      "alpha": "d",
      "latitude": "31.054487",
      "longitude": "-97.563461"
    }
  },
  "590000": {
    "590100": {
      "name": "犹他州",
      "alpha": "y",
      "latitude": "40.150032",
      "longitude": "-111.862434"
    }
  },
  "610000": {
    "610100": {
      "name": "佛蒙特州",
      "alpha": "f",
      "latitude": "44.045876",
      "longitude": "-72.710686"
    }
  },
  "620000": {
    "620100": {
      "name": "弗吉尼亚州",
      "alpha": "f",
      "latitude": "37.769337",
      "longitude": "-78.169968"
    }
  },
  "630000": {
    "630100": {
      "name": "华盛顿州",
      "alpha": "h",
      "latitude": "47.400902",
      "longitude": "-121.490494"
    }
  },
  "640000": {
    "640100": {
      "name": "西弗吉尼亚州",
      "alpha": "x",
      "latitude": "38.491226",
      "longitude": "-80.954665"
    }
  },
  "650000": {
    "650100": {
      "name": "威斯康星州",
      "alpha": "w",
      "latitude": "44.268543",
      "longitude": "-89.616508"
    }
  },
  "660000": {
    "660100": {
      "name": "怀俄明州",
      "alpha": "h",
      "latitude": "42.755966",
      "longitude": "-107.302490"
    }
  },
};
